import React from "react";
import "./styles.css";
import PersonInfo from "./PersonInfo";
import TeamData from "../../Constants/TeamData";

export default function About() {
	return (
		<section className="about-section">
			<div class="about-title">
				<h1> درباره </h1>
				<div class="title-line"></div>
			</div>
			<div class="about-content">
				<div class="about-text">
					<p>
						لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
						استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
						ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
						کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی
						در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
						می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
						الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این
						صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و
						شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای
						اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
						استفاده قرار گیرد.
					</p>
				</div>
				<div class="about-team">
					<h1>تیم فنی </h1>
					<p>
						{" "}
						لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
						استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
						ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
						کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی
						در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
						می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
						الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.
					</p>
					<div class="team-container">
						{TeamData.map((team) => (
							<PersonInfo team={team} />
						))}
					</div>
				</div>
			</div>
		</section>
	);
}
